In [1]:
import numpy as np
import pandas as pd
import seaborn as sn
from matplotlib import pyplot as plt

In [4]:
df= pd.read_csv('open_pubs.csv', 
                 names=['FSA_ID','Name','Address','PostCode','Easting','Northing','Latitude','Longitude','Local_Authority'])
df.head()

,FSA_ID,Name,Address,PostCode,Easting,Northing,Latitude,Longitude,Local_Authority
0,22,Anchor Inn,"Upper Street, Stratford St Mary, COLCHESTER",CO7 6LW,604749,234404,51.970379,0.979340,Babergh
1,36,Ark Bar Restaurant,"Ark Bar And Restaurant, Cattawade Street, Bran...",CO11 1RH,610194,233329,51.958698,1.057832,Babergh
2,74,Black Boy,"The Lady Elizabeth, 7 Market Hill, SUDBURY, Su...",CO10 2EA,587334,241316,52.038595,0.729915,Babergh
3,75,Black Horse,"Lower Street, Stratford St Mary, COLCHESTER",CO7 6JS,622675,-5527598,\N,\N,Babergh
4,76,Black Lion,"Lion Road, Glemsford, SUDBURY",CO10 7RF,622675,-5527598,\N,\N,Babergh

In [6]:
df.isnull().sum()

FSA_ID             0
Name               0
Address            0
PostCode           0
Easting            0
Northing           0
Latitude           0
Longitude          0
Local_Authority    0
dtype: int64

In [11]:
# latitude and longitude column contains \n values replace them with nan

df['Latitude'].replace('\\N',np.nan,inplace=True)
df['Longitude'].replace('\\N',np.nan,inplace=True)

In [12]:
df.isnull().sum()

FSA_ID               0
Name                 0
Address              0
PostCode             0
Easting              0
Northing             0
Latitude           767
Longitude          767
Local_Authority      0
dtype: int64

In [13]:
# now drop nan values

df.dropna(inplace=True)

In [14]:
df.isnull().sum()

FSA_ID             0
Name               0
Address            0
PostCode           0
Easting            0
Northing           0
Latitude           0
Longitude          0
Local_Authority    0
dtype: int64

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 50564 entries, 0 to 51330
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   FSA_ID           50564 non-null  int64
 1   Name             50564 non-null  object
 2   Address          50564 non-null  object
 3   PostCode         50564 non-null  object
 4   Easting          50564 non-null  int64
 5   Northing         50564 non-null  int64
 6   Latitude         50564 non-null  object
 7   Longitude        50564 non-null  object
 8   Local_Authority  50564 non-null  object
dtypes: int64(3), object(6)
memory usage: 3.9+ MB

In [16]:
#convert latitude and longitude to float

df.Latitude=df.Latitude.astype(float)
df.Longitude=df.Longitude.astype(float)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 50564 entries, 0 to 51330
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   FSA_ID           50564 non-null  int64
 1   Name             50564 non-null  object
 2   Address          50564 non-null  object
 3   PostCode         50564 non-null  object
 4   Easting          50564 non-null  int64
 5   Northing         50564 non-null  int64
 6   Latitude         50564 non-null  float64
 7   Longitude        50564 non-null  float64
 8   Local_Authority  50564 non-null  object
dtypes: float64(2), int64(3), object(4)
memory usage: 3.9+ MB

In [18]:
#save the data into csv file

df.to_csv('pub_df.csv',index=False)